nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_shell.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdlib.h>
#include <zephyr/kernel.h>
#include <zephyr/shell/shell.h>
#include <getopt.h>
#include <net/nrf_cloud_agps.h>

#include "mosh_print.h"
#include "gnss.h"

#define AGPS_CMD_LINE_INJECT_MAX_LENGTH MIN(3500, CONFIG_SHELL_CMD_BUFF_SIZE)

static bool gnss_running;

static int print_help(const struct shell *shell, size_t argc, char **argv)
{
	int ret = 1;

	if (argc > 1) {
		mosh_error("%s: subcommand not found", argv[1]);
		ret = -EINVAL;
	}

	shell_help(shell);

	return ret;
}

static int cmd_gnss(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_start(const struct shell *shell, size_t argc, char **argv)
{
	int err;

	if (gnss_running) {
		mosh_error("start: GNSS already running");
		return -ENOEXEC;
	}

	err = gnss_start();
	if (!err) {
		gnss_running = true;
	} else {
		mosh_error("start: starting GNSS failed, err %d", err);
	}

	return err;
}

static int cmd_gnss_stop(const struct shell *shell, size_t argc, char **argv)
{
	int err;

	if (!gnss_running) {
		mosh_error("stop: GNSS not running");
		return -ENOEXEC;
	}

	err = gnss_stop();
	if (!err) {
		gnss_running = false;
	} else {
		mosh_error("stop: stopping GNSS failed, err %d", err);
	}

	return err;
}

static int cmd_gnss_delete(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_delete_ephe(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_delete_data(GNSS_DATA_DELETE_EPHEMERIDES);
}

static int cmd_gnss_delete_all(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_delete_data(GNSS_DATA_DELETE_ALL);
}

static int cmd_gnss_delete_tcxo(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_delete_data(GNSS_DATA_DELETE_TCXO);
}

static int cmd_gnss_mode(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_mode_cont(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_continuous_mode();
}

static int cmd_gnss_mode_single(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int timeout;

	timeout = atoi(argv[1]);
	if (timeout < 0 || timeout > UINT16_MAX) {
		mosh_error("single: invalid timeout value %d", timeout);
		return -EINVAL;
	}

	return gnss_set_single_fix_mode(timeout);
}

static int cmd_gnss_mode_periodic(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int interval;
	int timeout;

	interval = atoi(argv[1]);
	if (interval <= 0) {
		mosh_error(
			"periodic: invalid interval value %d, the value must be greater than 0",
			interval);
		return -EINVAL;
	}

	timeout = atoi(argv[2]);
	if (timeout < 0 || timeout > UINT16_MAX) {
		mosh_error(
			"periodic: invalid timeout value %d, the value must be 0...65535",
			timeout);
		return -EINVAL;
	}

	return gnss_set_periodic_fix_mode(interval, timeout);
}

static int cmd_gnss_mode_periodic_gnss(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int interval;
	int timeout;

	interval = atoi(argv[1]);
	if (interval < 10 || interval > UINT16_MAX) {
		mosh_error(
			"periodic_gnss: invalid interval value %d, the value must be 10...65535",
			interval);
		return -EINVAL;
	}

	timeout = atoi(argv[2]);
	if (timeout < 0 || timeout > UINT16_MAX) {
		mosh_error(
			"periodic_gnss: invalid timeout value %d, the value must be 0...65535",
			timeout);
		return -EINVAL;
	}

	return gnss_set_periodic_fix_mode_gnss(interval, timeout);
}

static int cmd_gnss_dynamics(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_dynamics_general(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_dynamics_mode(GNSS_DYNAMICS_MODE_GENERAL);
}

static int cmd_gnss_dynamics_stationary(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_dynamics_mode(GNSS_DYNAMICS_MODE_STATIONARY);
}

static int cmd_gnss_dynamics_pedestrian(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_dynamics_mode(GNSS_DYNAMICS_MODE_PEDESTRIAN);
}

static int cmd_gnss_dynamics_automotive(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_dynamics_mode(GNSS_DYNAMICS_MODE_AUTOMOTIVE);
}

static int cmd_gnss_config(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}


static int cmd_gnss_config_system(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int value;
	uint8_t system_mask;

	system_mask = 0x1; /* GPS bit always enabled */

	/* QZSS */
	value = atoi(argv[1]);
	if (value == 1) {
		system_mask |= 0x4;
	}

	return gnss_set_system_mask(system_mask);
}

static int cmd_gnss_config_elevation(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int elevation;

	if (argc != 2) {
		mosh_error("elevation: wrong parameter count");
		mosh_print("elevation: <angle>");
		mosh_print(
			"angle:\tElevation threshold angle (in degrees, default 5). "
			"Satellites with elevation angle less than the threshold are excluded.");
		return -EINVAL;
	}

	elevation = atoi(argv[1]);

	if (elevation < 0 || elevation > 90) {
		mosh_error("elevation: invalid elevation value %d", elevation);
		return -EINVAL;
	}

