nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_shell.c
	return gnss_set_elevation_threshold(elevation);
}

static int cmd_gnss_config_use_case(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	uint8_t value;
	bool low_accuracy_enabled = false;
	bool scheduled_downloads_disabled = false;

	value = atoi(argv[1]);
	if (value == 1) {
		low_accuracy_enabled = true;
	}

	value = atoi(argv[2]);
	if (value == 1) {
		scheduled_downloads_disabled = true;
	}

	return gnss_set_use_case(low_accuracy_enabled, scheduled_downloads_disabled);
}

static int cmd_gnss_config_nmea(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	uint8_t value;
	uint16_t nmea_mask;
	uint16_t nmea_mask_bit;

	nmea_mask = 0;
	nmea_mask_bit = 1;
	for (int i = 0; i < 5; i++) {
		value = atoi(argv[i + 1]);
		if (value == 1) {
			nmea_mask |= nmea_mask_bit;
		}
		nmea_mask_bit = nmea_mask_bit << 1;
	}

	return gnss_set_nmea_mask(nmea_mask);
}

static int cmd_gnss_config_powersave(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_config_powersave_off(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_duty_cycling_policy(GNSS_DUTY_CYCLING_DISABLED);
}

static int cmd_gnss_config_powersave_perf(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_duty_cycling_policy(GNSS_DUTY_CYCLING_PERFORMANCE);
}

static int cmd_gnss_config_powersave_power(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_duty_cycling_policy(GNSS_DUTY_CYCLING_POWER);
}

static int cmd_gnss_config_qzss(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_config_qzss_nmea(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_config_qzss_nmea_standard(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_qzss_nmea_mode(GNSS_QZSS_NMEA_MODE_STANDARD);
}

static int cmd_gnss_config_qzss_nmea_custom(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_qzss_nmea_mode(GNSS_QZSS_NMEA_MODE_CUSTOM);
}

static int cmd_gnss_config_qzss_mask(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int value;
	uint16_t qzss_mask;
	uint16_t qzss_mask_bit;

	qzss_mask = 0;
	qzss_mask_bit = 1;
	for (int i = 0; i < 10; i++) {
		value = atoi(argv[i + 1]);
		if (value == 1) {
			qzss_mask |= qzss_mask_bit;
		}
		qzss_mask_bit = qzss_mask_bit << 1;
	}

	return gnss_set_qzss_mask(qzss_mask);
}

static int cmd_gnss_config_timing(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_config_timing_rtc(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_timing_source(GNSS_TIMING_SOURCE_RTC);
}

static int cmd_gnss_config_timing_tcxo(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_timing_source(GNSS_TIMING_SOURCE_TCXO);
}

static int cmd_gnss_priority(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_priority_enable(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_priority_time_windows(true);
}

static int cmd_gnss_priority_disable(const struct shell *shell, size_t argc, char **argv)
{
	if (!gnss_running) {
		mosh_error("%s: start GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	return gnss_set_priority_time_windows(false);
}

static int cmd_gnss_agps_automatic(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_agps_automatic_enable(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_set_agps_automatic(true);
}

static int cmd_gnss_agps_automatic_disable(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_set_agps_automatic(false);
}

static int cmd_gnss_agps_filtered(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_agps_filtered_enable(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_set_agps_filtered_ephemerides(true);
}

static int cmd_gnss_agps_filtered_disable(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_set_agps_filtered_ephemerides(false);
}

static int cmd_gnss_agps(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_agps_inject(const struct shell *shell, size_t argc, char **argv)
{
	int ret = 0;

	if (argc == 1) {
		/* Fetch assistance data from nRF cloud or from SUPL server and inject */
		ret = gnss_inject_agps_data();
	} else if (argc == 2) {
		/* Assistance data provided as command line argument */
#if defined(CONFIG_NRF_CLOUD_AGPS)
		size_t bin_array_length = 0;

		if (strlen(argv[1]) <= AGPS_CMD_LINE_INJECT_MAX_LENGTH) {
			char *buf = k_malloc(sizeof(char) * AGPS_CMD_LINE_INJECT_MAX_LENGTH);

			if (buf == NULL) {
				mosh_error("Cannot allocate memory for the assistance data");
				return -ENOMEM;
			}
			bin_array_length = hex2bin(argv[1],
						   strlen(argv[1]),
						   buf,
						   AGPS_CMD_LINE_INJECT_MAX_LENGTH);

			if (bin_array_length) {
				mosh_print("Injecting %d bytes", bin_array_length);
				ret = nrf_cloud_agps_process(buf, bin_array_length);
			} else {
				mosh_error("Assistance data not in valid hexadecimal format");
				ret = -EINVAL;
			}
			k_free(buf);
		} else {
			mosh_error("Assistance data length %d exceeds the maximum length of %d",
				   strlen(argv[1]),
				   AGPS_CMD_LINE_INJECT_MAX_LENGTH);
			ret = -EINVAL;
		}
#else
		mosh_error("GNSS: Enable CONFIG_NRF_CLOUD_AGPS to enable the processing of "
			   "A-GPS data");
		ret = -EOPNOTSUPP;
#endif
	}
	return ret;
}

