nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_shell.c
static int cmd_gnss_agps_expiry(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_get_agps_expiry();
}

static int cmd_gnss_agps_ref_altitude(const struct shell *shell, size_t argc, char **argv)
{
	int altitude = 0;
	int err = 0;
	struct nrf_modem_gnss_agps_data_location location = { 0 };

	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	if (argc != 2) {
		mosh_error("ref_altitude: wrong parameter count");
		mosh_print("ref_altitude: <altitude>");
		mosh_print(
			"altitude:\tReference altitude [m] with regard to the reference ellipsoid "
			"surface");
		return -EINVAL;
	}

	altitude = atoi(argv[1]);

	if (altitude < -32767 || altitude > 32767) {
		mosh_error("ref_altitude: invalid altitude value %d", altitude);
		return -EINVAL;
	}

	/* Only inject altitude, thus set unc_semimajor and unc_semiminor to 255 which indicates
	 * that latitude and longitude are not to be used. Set confidence to 100 for maximum
	 * confidence.
	 */
	location.unc_semimajor = 255;
	location.unc_semiminor = 255;
	location.confidence = 100;
	location.altitude = altitude;
	/* The altitude uncertainty has to be less than 100 meters (coded number K has to
	 * be less than 48) for the altitude to be used for a 3-sat fix. GNSS increases
	 * the uncertainty depending on the age of the altitude and whether the device is
	 * stationary or moving. The uncertainty is set to 0 (meaning 0 meters), so that
	 * it remains usable for a 3-sat fix for as long as possible.
	 */
	location.unc_altitude = 0;

	err = nrf_modem_gnss_agps_write(&location, sizeof(location), NRF_MODEM_GNSS_AGPS_LOCATION);
	if (err) {
		mosh_error("Failed to set reference altitude, error: %d", err);
	}

	return err;
}

static int cmd_gnss_pgps(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_pgps_enable(const struct shell *shell, size_t argc, char **argv)
{
	return gnss_enable_pgps();
}

static int cmd_gnss_agps_filter(const struct shell *shell, size_t argc, char **argv)
{
	bool ephe_enabled;
	bool alm_enabled;
	bool utc_enabled;
	bool klob_enabled;
	bool neq_enabled;
	bool time_enabled;
	bool pos_enabled;
	bool int_enabled;

	if (argc != 9) {
		mosh_error("filter: wrong parameter count");
		mosh_print("filter: <ephe> <alm> <utc> <klob> <neq> <time> <pos> <integrity>");
		mosh_print("ephe:\n  0 = disabled\n  1 = enabled");
		mosh_print("alm:\n  0 = disabled\n  1 = enabled");
		mosh_print("utc:\n  0 = disabled\n  1 = enabled");
		mosh_print("klob:\n  0 = disabled\n  1 = enabled");
		mosh_print("neq:\n  0 = disabled\n  1 = enabled");
		mosh_print("time:\n  0 = disabled\n  1 = enabled");
		mosh_print("pos:\n  0 = disabled\n  1 = enabled");
		mosh_print("integrity:\n  0 = disabled\n  1 = enabled");
		return -EINVAL;
	}

	ephe_enabled = atoi(argv[1]) == 1 ? true : false;
	alm_enabled = atoi(argv[2]) == 1 ? true : false;
	utc_enabled = atoi(argv[3]) == 1 ? true : false;
	klob_enabled = atoi(argv[4]) == 1 ? true : false;
	neq_enabled = atoi(argv[5]) == 1 ? true : false;
	time_enabled = atoi(argv[6]) == 1 ? true : false;
	pos_enabled = atoi(argv[7]) == 1 ? true : false;
	int_enabled = atoi(argv[8]) == 1 ? true : false;

	return gnss_set_agps_data_enabled(ephe_enabled, alm_enabled, utc_enabled,
					  klob_enabled, neq_enabled, time_enabled,
					  pos_enabled, int_enabled);
}

static int cmd_gnss_1pps(const struct shell *shell, size_t argc, char **argv)
{
	return print_help(shell, argc, argv);
}

static int cmd_gnss_1pps_enable(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int interval;
	int pulse_width;

	interval = atoi(argv[1]);
	if (interval < 0 || interval > 1800) {
		mosh_error(
			"start: invalid interval value %d, the value must be 0...1800",
			interval);
		return -EINVAL;
	}

	pulse_width = atoi(argv[2]);
	if (pulse_width < 1 || pulse_width > 500) {
		mosh_error(
			"start: invalid pulse width value %d, the value must be 1...500",
			interval);
		return -EINVAL;
	}

	struct gnss_1pps_mode mode = { 0 };

	mode.enable = true;
	mode.pulse_interval = interval;
	mode.pulse_width = pulse_width;
	mode.apply_start_time = false;

	return gnss_set_1pps_mode(&mode);
}

/* Parses a date string in format "dd.mm.yyyy" */
static int parse_date_string(char *date_string, uint16_t *year, uint8_t *month, uint8_t *day)
{
	char number[5];
	int value;

	if (strlen(date_string) != 10) {
		return -1;
	}

	/* Day */
	number[0] = *date_string;
	date_string++;
	number[1] = *date_string;
	date_string++;
	number[2] = '\0';
	value = atoi(number);
	if (value >= 1 && value <= 31) {
		*day = value;
	} else {
		return -1;
	}

	if (*date_string != '.') {
		return -1;
	}
	date_string++;

	/* Month */
	number[0] = *date_string;
	date_string++;
	number[1] = *date_string;
	date_string++;
	number[2] = '\0';
	value = atoi(number);
	if (value >= 1 && value <= 12) {
		*month = value;
	} else {
		return -1;
	}

	if (*date_string != '.') {
		return -1;
	}
	date_string++;

	/* Year */
	number[0] = *date_string;
	date_string++;
	number[1] = *date_string;
	date_string++;
	number[2] = *date_string;
	date_string++;
	number[3] = *date_string;
	number[4] = '\0';
	value = atoi(number);
	if (value >= 0 && value <= 4000) {
		*year = value;
	} else {
		return -1;
	}

	return 0;
}

/* Parses a time string in format "hh:mm:ss" */
static int parse_time_string(char *time_string, uint8_t *hour, uint8_t *minute, uint8_t *second)
{
	char number[3];
	int value;

	if (strlen(time_string) != 8) {
		return -1;
	}

	/* Hour */
	number[0] = *time_string;
	time_string++;
	number[1] = *time_string;
	time_string++;
	number[2] = '\0';
	value = atoi(number);
	if (value >= 0 && value <= 23) {
		*hour = value;
	} else {
		return -1;
	}

	if (*time_string != ':') {
		return -1;
	}
	time_string++;

	/* Minute */
	number[0] = *time_string;
	time_string++;
	number[1] = *time_string;
	time_string++;
	number[2] = '\0';
	value = atoi(number);
	if (value >= 0 && value <= 59) {
		*minute = value;
	} else {
		return -1;
	}

