nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/gnss/gnss_shell.c
	if (*time_string != ':') {
		return -1;
	}
	time_string++;

	/* Second */
	number[0] = *time_string;
	time_string++;
	number[1] = *time_string;
	number[2] = '\0';
	value = atoi(number);
	if (value >= 0 && value <= 59) {
		*second = value;
	} else {
		return -1;
	}

	return 0;
}

static int cmd_gnss_1pps_enable_at(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	int interval;
	int pulse_width;

	interval = atoi(argv[1]);
	if (interval < 0 || interval > 1800) {
		mosh_error(
			"start_at: invalid interval value %d, the value must be 0...1800",
			interval);
		return -EINVAL;
	}

	pulse_width = atoi(argv[2]);
	if (pulse_width < 1 || pulse_width > 500) {
		mosh_error(
			"start_at: invalid pulse width value %d, the value must be 1...500",
			interval);
		return -EINVAL;
	}

	struct gnss_1pps_mode mode = { 0 };

	mode.enable = true;
	mode.pulse_interval = interval;
	mode.pulse_width = pulse_width;
	mode.apply_start_time = true;

	/* Parse date */
	if (parse_date_string(argv[3], &mode.year, &mode.month, &mode.day) != 0) {
		mosh_error(
			"start_at: invalid date string %s",
			argv[3]);
		return -EINVAL;
	}

	/* Parse time */
	if (parse_time_string(argv[4], &mode.hour, &mode.minute, &mode.second) != 0) {
		mosh_error(
			"start_at: invalid time string %s",
			argv[4]);
		return -EINVAL;
	}

	return gnss_set_1pps_mode(&mode);
}

static int cmd_gnss_1pps_disable(const struct shell *shell, size_t argc, char **argv)
{
	if (gnss_running) {
		mosh_error("%s: stop GNSS to execute command", argv[0]);
		return -ENOEXEC;
	}

	struct gnss_1pps_mode mode = { 0 };

	mode.enable = false;

	return gnss_set_1pps_mode(&mode);
}

static int cmd_gnss_output(const struct shell *shell, size_t argc, char **argv)
{
	int err;
	int pvt_level;
	int nmea_level;
	int event_level;

	if (argc != 4) {
		mosh_error("output: wrong parameter count");
		mosh_print("output: <pvt level> <nmea level> <event level>");
		mosh_print("pvt level:\n  0 = no PVT output\n  1 = PVT output");
		mosh_print("  2 = PVT output with SV information (default)");
		mosh_print("nmea level:\n  0 = no NMEA output (default)\n"
				"  1 = NMEA output");
		mosh_print("event level:\n  0 = no event output (default)\n"
				"  1 = event output");
		return -EINVAL;
	}

	pvt_level = atoi(argv[1]);
	nmea_level = atoi(argv[2]);
	event_level = atoi(argv[3]);

	err = gnss_set_pvt_output_level(pvt_level);
	if (err) {
		mosh_error("output: invalid PVT output level");
	}
	err = gnss_set_nmea_output_level(nmea_level);
	if (err) {
		mosh_error("output: invalid NMEA output level");
	}
	err = gnss_set_event_output_level(event_level);
	if (err) {
		mosh_error("output: invalid event output level");
	}

	return 0;
}

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_delete,
	SHELL_CMD_ARG(ephe, NULL, "Delete ephemerides (forces a warm start).",
		      cmd_gnss_delete_ephe, 1, 0),
	SHELL_CMD_ARG(all, NULL, "Delete all data, except the TCXO offset (forces a cold start).",
		      cmd_gnss_delete_all, 1, 0),
	SHELL_CMD_ARG(tcxo, NULL, "Delete the TCXO offset.",
		      cmd_gnss_delete_tcxo, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_mode,
	SHELL_CMD_ARG(cont, NULL, "Continuous tracking mode (default).", cmd_gnss_mode_cont, 1, 0),
	SHELL_CMD_ARG(single, NULL, "<timeout>\nSingle fix mode.", cmd_gnss_mode_single, 2, 0),
	SHELL_CMD_ARG(periodic, NULL,
		      "<interval> <timeout>\nPeriodic fix mode controlled by application.",
		      cmd_gnss_mode_periodic, 3, 0),
	SHELL_CMD_ARG(periodic_gnss, NULL,
		      "<interval> <timeout>\nPeriodic fix mode controlled by GNSS.",
		      cmd_gnss_mode_periodic_gnss, 3, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_dynamics,
	SHELL_CMD_ARG(general, NULL, "General purpose.", cmd_gnss_dynamics_general, 1, 0),
	SHELL_CMD_ARG(stationary, NULL, "Optimize for stationary use.",
		      cmd_gnss_dynamics_stationary, 1, 0),
	SHELL_CMD_ARG(pedestrian, NULL, "Optimize for pedestrian use.",
		      cmd_gnss_dynamics_pedestrian, 1, 0),
	SHELL_CMD_ARG(automotive, NULL, "Optimize for automotive use.",
		      cmd_gnss_dynamics_automotive, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_config_powersave,
	SHELL_CMD_ARG(off, NULL, "Power saving off (default).",
		      cmd_gnss_config_powersave_off, 1, 0),
	SHELL_CMD_ARG(perf, NULL, "Power saving without significant performance degradation.",
		      cmd_gnss_config_powersave_perf, 1, 0),
	SHELL_CMD_ARG(power, NULL, "Power saving with acceptable performance degradation.",
		      cmd_gnss_config_powersave_power, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_config_qzss_nmea,
	SHELL_CMD_ARG(standard, NULL, "Standard NMEA reporting.",
		      cmd_gnss_config_qzss_nmea_standard, 1, 0),
	SHELL_CMD_ARG(custom, NULL, "Custom NMEA reporting.",
		      cmd_gnss_config_qzss_nmea_custom, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_config_qzss,
	SHELL_CMD(nmea, &sub_gnss_config_qzss_nmea, "QZSS NMEA mode.", cmd_gnss_config_qzss_nmea),
	SHELL_CMD_ARG(mask, NULL,
		      "<193> <194> <195> <196> <197> <198> <199> <200> <201> <202>\n"
		      "QZSS NMEA mask for PRNs 193...202. 0 = disabled, 1 = enabled.",
		      cmd_gnss_config_qzss_mask, 11, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_config_timing,
	SHELL_CMD_ARG(rtc, NULL, "RTC (default).", cmd_gnss_config_timing_rtc, 1, 0),
	SHELL_CMD_ARG(tcxo, NULL, "TCXO.", cmd_gnss_config_timing_tcxo, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_config,
	SHELL_CMD_ARG(system, NULL,
		      "<QZSS enabled>\n"
		      "System mask. 0 = disabled, 1 = enabled. GPS L1 C/A is always enabled.",
		      cmd_gnss_config_system, 2, 0),
	SHELL_CMD(elevation, NULL, "<angle>\nElevation threshold angle.",
		  cmd_gnss_config_elevation),
	SHELL_CMD_ARG(use_case, NULL,
		      "<low accuracy allowed> <scheduled downloads disabled>\n"
		      "Use case configuration. 0 = option disabled, 1 = option enabled "
		      "(default all disabled).",
		      cmd_gnss_config_use_case, 3, 0),
	SHELL_CMD_ARG(nmea, NULL,
		      "<GGA enabled> <GLL enabled> <GSA enabled> <GSV enabled> <RMC enabled>\n"
		      "NMEA mask. 0 = disabled, 1 = enabled (default all enabled).",
		      cmd_gnss_config_nmea, 6, 0),
	SHELL_CMD(powersave, &sub_gnss_config_powersave, "Continuous tracking power saving mode.",
		  cmd_gnss_config_powersave),
	SHELL_CMD(qzss, &sub_gnss_config_qzss, "QZSS configuration.", cmd_gnss_config_qzss),
	SHELL_CMD(timing, &sub_gnss_config_timing, "Timing source during sleep.",
		  cmd_gnss_config_timing),
	SHELL_SUBCMD_SET_END
	);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_priority,
	SHELL_CMD_ARG(enable, NULL, "Enable priority time window requests.",
		      cmd_gnss_priority_enable, 1, 0),
	SHELL_CMD_ARG(disable, NULL, "Disable priority time window requests.",
		      cmd_gnss_priority_disable, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_agps_automatic,
	SHELL_CMD_ARG(enable, NULL, "Enable automatic fetching of AGPS data.",
		      cmd_gnss_agps_automatic_enable, 1, 0),
	SHELL_CMD_ARG(disable, NULL, "Disable automatic fetching of AGPS data (default).",
		      cmd_gnss_agps_automatic_disable, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_agps_filtered,
	SHELL_CMD_ARG(enable, NULL, "Enable AGPS filtered ephemerides.",
		      cmd_gnss_agps_filtered_enable, 1, 0),
	SHELL_CMD_ARG(disable, NULL, "Disable AGPS filtered ephemerides (default).",
		      cmd_gnss_agps_filtered_disable, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_agps,
	SHELL_CMD(automatic, &sub_gnss_agps_automatic,
		  "Enable/disable automatic fetching of AGPS data.", cmd_gnss_agps_automatic),
	SHELL_CMD_ARG(inject, NULL, "[assistance_data]\nFetch and inject AGPS data to GNSS. "
				    "Assistance data can be provided on command line in "
				    "hexadecimal format without spaces. If <assistance_data> is "
				    "left empty, the data is fetched from either nRF cloud or SUPL "
				    "server.",
		      cmd_gnss_agps_inject, 1, 1),
	SHELL_CMD(filter, NULL,
		  "<ephe> <alm> <utc> <klob> <neq> <time> <pos> <integrity>\nSet filter for "
		  "allowed AGPS data. 0 = disabled, 1 = enabled (default all enabled).",
		  cmd_gnss_agps_filter),
	SHELL_CMD(filtephem, &sub_gnss_agps_filtered,
		  "Enable/disable AGPS filtered ephemerides.", cmd_gnss_agps_filtered),
	SHELL_CMD_ARG(expiry, NULL, "Query A-GPS data expiry information from GNSS.",
		      cmd_gnss_agps_expiry, 1, 0),
	SHELL_CMD(ref_altitude, NULL, "Reference altitude for 3-sat fix in meters with regard to "
				      "the reference ellipsoid surface.",
		  cmd_gnss_agps_ref_altitude),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_pgps,
	SHELL_CMD_ARG(enable, NULL, "Enable P-GPS.",
		      cmd_gnss_pgps_enable, 1, 0),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss_1pps,
	SHELL_CMD_ARG(enable, NULL, "<interval (s)> <pulse length (ms)>\nEnable 1PPS.",
		      cmd_gnss_1pps_enable, 3, 0),
	SHELL_CMD_ARG(enable_at, NULL,
		      "<interval (s)> <pulse length (ms)> <dd.mm.yyyy> <hh:mm:ss>\n"
		      "Enable 1PPS at a specific time (UTC).", cmd_gnss_1pps_enable_at, 5, 0),
	SHELL_CMD(disable, NULL, "Disable 1PPS.", cmd_gnss_1pps_disable),
	SHELL_SUBCMD_SET_END
);

SHELL_STATIC_SUBCMD_SET_CREATE(
	sub_gnss,
	SHELL_CMD_ARG(start, NULL, "Start GNSS.", cmd_gnss_start, 1, 0),
	SHELL_CMD_ARG(stop, NULL, "Stop GNSS.", cmd_gnss_stop, 1, 0),
	SHELL_CMD(delete, &sub_gnss_delete, "Delete GNSS data.", cmd_gnss_delete),
	SHELL_CMD(mode, &sub_gnss_mode, "Set tracking mode.", cmd_gnss_mode),
	SHELL_CMD(dynamics, &sub_gnss_dynamics, "Set dynamics mode.", cmd_gnss_dynamics),
	SHELL_CMD(config, &sub_gnss_config, "Set GNSS configuration.", cmd_gnss_config),
	SHELL_CMD(priority, &sub_gnss_priority, "Enable/disable priority time window requests.",
		  cmd_gnss_priority),
	SHELL_CMD(agps, &sub_gnss_agps, "A-GPS configuration and commands.", cmd_gnss_agps),
	SHELL_CMD(pgps, &sub_gnss_pgps, "P-GPS commands.", cmd_gnss_pgps),
	SHELL_CMD(1pps, &sub_gnss_1pps, "1PPS control.", cmd_gnss_1pps),
	SHELL_CMD(output, NULL, "<pvt level> <nmea level> <event level>\nSet output levels.",
		  cmd_gnss_output),
	SHELL_SUBCMD_SET_END
);

SHELL_CMD_REGISTER(gnss, &sub_gnss, "Commands for controlling GNSS.", cmd_gnss);
